let fn = function () {

};
//箭头函数
let fn2 = () => {
};
//===================================================
let fn3 = (a) => {
//若参数仅仅有一个 则()可以省略
};

let fn4 = a => {

};
//===================================================
//2. return 可以省略直接写在箭头后面并且去掉括号
let fn5 = (a, b) => a + b;
//===================================================

let fn6 = function (a, b) {

    return function (c) {
        return a + b + c //这里没有a,b 会向上层查找a,b
    };
    // 闭包
};

console.log(fn6(1, 2)(3)); //->6

let fn7 = (a, b) => c => a + b + c; //->高阶函数
console.log(fn7(1, 2)(3));

//===================================================
let s
let f = (a, b) => {

     s = a + b / a - b + 1;
    console.log(s);
};
f(3,4);
