//============================================
//1. 解构赋值导入 ,获得已存在的属性名
import {str, sum} from './1.export.js';
console.log('解构赋值导入：', str, sum(1, 2));

//============================================
//2. 通配符，接受所有被export的 赋值给 as 从 哪里？
import * as all from './1.export.js'; //必须添加后缀名
console.log('通配符导入所有：', all); //->{{result:9, str= 'world' }

//============================================
//3. 引用时可以使用任意名字 (默认导出模式可以使用)
import every from './1.export.js'
console.log('默认导出', every);
//============================================